Documents/ИзменениеШтатногоРасписанияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ИзменениеШтатногоРасписанияОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ШтатноеРасписаниеОрганизаций</xr:Item>
				<xr:Item>InformationRegister.НадбавкиПоШтатномуРасписаниюОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтатныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяТарифнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяТарифнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияВБухучете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеНачисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданоНовыхРабочихМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Надбавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНадбавки</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияВБухучете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ШтатноеРасписаниеОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШтатноеРасписаниеОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТарифнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаТарифнойСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеНачисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СозданоНовыхРабочихМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НадбавкиПоШтатномуРасписаниюОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НадбавкиПоШтатномуРасписаниюОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНадбавки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИзменениеШтатногоРасписанияОрганизаций/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(НазваниеМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если НЕ Проведен Тогда
		Предупреждение(НСтр("ru='Документ можно распечатать только после его проведения!';uk='Документ можна роздрукувати тільки після його проведення!'"));
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	ИмяМакета           = НазваниеМакета;

	// Получить экземпляр документа на печать
	Если      ИмяМакета = "ШтатноеРасписание" Тогда
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИзменениеШтатногоРасписанияОрганизации_ШтатноеРасписание";

		НовыйОтчет = Отчеты.УтвержденноеШтатноеРасписаниеОрганизаций.Создать();
		НовыйОтчет.ДатаАктуальности = Дата;
		НовыйОтчет.ПараметрОтбора = Ссылка;

		ЕстьОшибки = ЛОЖЬ;
		НовыйОтчет.СформироватьОтчет(ТабДокумент,ЕстьОшибки);
		Если ЕстьОшибки тогда
			Предупреждение(НСтр("ru='При формировании отчета возникли ошибки!';uk='При формуванні звіту виникли помилки!'"));
			Возврат;
		КонецЕсли;	 
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,НСтр("ru='Изменение штатного расписания организации';uk='Зміна штатного розкладу організації'")),Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	Возврат Новый Структура("ШтатноеРасписание",НСтр("ru='Штатное расписание';uk='Штатний розклад'"));
КонецФункции // ПолучитьСтруктуруПечатныхФорм()


#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ

// Возвращает список алгоритмов начислений надбавок
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокВариантовНадбавок() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма);	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы);	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы);
	
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокВариантовНадбавок()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "Штатные единицы" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШтатныеЕдиницы(Режим)
	

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДатаДока", Дата);
	Запрос.УстановитьПараметр("ДатаДока1", Дата + 1);
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);

	// Описание текста запроса:
	// Первая часть запроса  - вид строки запроса "ДанныеДляДвижений": 
	// 1. Выборка "СтрокиДокумента": 
	//		Выбираются строки документа.  
	// 2. Выборка "ПересекающиесяСтроки": 
	//		Среди остальных строк документа ищем строки с одинаковым значением 
    //      реквизитов "Подразделение" и "Должность"
	// 3. Выборка "ШтатноеРасписание": 
    //      Из регистра сведений выбираем сведения об изменяемых штатных единицах.
    //

	Запрос.Текст = "ВЫБРАТЬ
	               |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	               |	СтрокиДокумента.Подразделение,
	               |	СтрокиДокумента.Должность,
	               |	СтрокиДокумента.КоличествоСтавок,
	               |	СтрокиДокумента.СозданоНовыхРабочихМест,
	               |	СтрокиДокумента.МинимальнаяТарифнаяСтавка,
	               |	СтрокиДокумента.МаксимальнаяТарифнаяСтавка,
	               |	СтрокиДокумента.ВидТарифнойСтавки,
	               |	СтрокиДокумента.ВалютаТарифнойСтавки,
	               |	СтрокиДокумента.ГрафикРаботы,
	               |	СтрокиДокумента.СпособОтраженияВБухучете,
				   |	СтрокиДокумента.ОсновноеНачисление,
	               |	ВЫБОР КОГДА СтрокиДокумента.Подразделение.Владелец <> &Организация ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	               |	МИНИМУМ(ПересекающиесяСтроки.НомерСтроки) КАК КонфликтнаяСтрока,
	               |	ШтатноеРасписание.КоличествоСтавок КАК БылоСтавок,
	               |	ВЫБОР КОГДА ШтатноеРасписание.Период = &ДатаДока ТОГДА ШтатноеРасписание.Регистратор.Представление ИНАЧЕ ЛОЖЬ КОНЕЦ КАК НайденоСуществующееДвижение
	               |ИЗ
	               |	Документ.ИзменениеШтатногоРасписанияОрганизаций.ШтатныеЕдиницы КАК СтрокиДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеШтатногоРасписанияОрганизаций.ШтатныеЕдиницы КАК ПересекающиесяСтроки
	               |		ПО СтрокиДокумента.Ссылка = ПересекающиесяСтроки.Ссылка И СтрокиДокумента.Подразделение = ПересекающиесяСтроки.Подразделение И СтрокиДокумента.Должность = ПересекающиесяСтроки.Должность И СтрокиДокумента.НомерСтроки < ПересекающиесяСтроки.НомерСтроки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаДока1, ПодразделениеОрганизации В (ВЫБРАТЬ РАЗЛИЧНЫЕ 	ИзменениеШтатногоРасписанияОрганизацииШтатныеЕдиницы.Подразделение ИЗ Документ.ИзменениеШтатногоРасписанияОрганизаций.ШтатныеЕдиницы КАК ИзменениеШтатногоРасписанияОрганизацииШтатныеЕдиницы ГДЕ 	ИзменениеШтатногоРасписанияОрганизацииШтатныеЕдиницы.Ссылка = &ДокументСсылка )) КАК ШтатноеРасписание
	               |		ПО СтрокиДокумента.Подразделение = ШтатноеРасписание.ПодразделениеОрганизации И СтрокиДокумента.Должность = ШтатноеРасписание.Должность
	               |
	               |ГДЕ
	               |	СтрокиДокумента.Ссылка = &ДокументСсылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтрокиДокумента.НомерСтроки,
	               |	СтрокиДокумента.Подразделение,
	               |	СтрокиДокумента.Должность,
	               |	СтрокиДокумента.КоличествоСтавок,
	               |	СтрокиДокумента.СозданоНовыхРабочихМест,
	               |	СтрокиДокумента.МинимальнаяТарифнаяСтавка,
	               |	СтрокиДокумента.МаксимальнаяТарифнаяСтавка,
				   |	СтрокиДокумента.ВидТарифнойСтавки,
				   |	СтрокиДокумента.ВалютаТарифнойСтавки,
				   |	СтрокиДокумента.ГрафикРаботы,
				   |	СтрокиДокумента.СпособОтраженияВБухучете,
				   |	СтрокиДокумента.ОсновноеНачисление,
				   |	ШтатноеРасписание.КоличествоСтавок,
				   |	ВЫБОР КОГДА ШтатноеРасписание.Период = &ДатаДока ТОГДА ШтатноеРасписание.Регистратор.Представление ИНАЧЕ ЛОЖЬ КОНЕЦ";
				   
	Возврат Запрос.Выполнить();


КонецФункции // СформироватьЗапросПоВыданныеАвансы()

// Формирует запрос по таблице "Надбавки" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоНадбавки(Режим)
	

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	               |	СтрокиДокумента.Подразделение,
	               |	СтрокиДокумента.Должность,
	               |	СтрокиДокумента.ВидНадбавки,
	               |	СтрокиДокумента.ВидНадбавки.СпособРасчета,
	               |	СтрокиДокумента.Показатель1,
	               |	СтрокиДокумента.Показатель2,
	               |	СтрокиДокумента.Показатель3,
				   |	СтрокиДокумента.Показатель4,
				   |	СтрокиДокумента.Показатель5,
				   |	СтрокиДокумента.Показатель6,
	               |	СтрокиДокумента.Валюта1,
	               |	СтрокиДокумента.Валюта2,
	               |	СтрокиДокумента.Валюта3,
				   |	СтрокиДокумента.Валюта4,
				   |	СтрокиДокумента.Валюта5,
				   |	СтрокиДокумента.Валюта6,
	               |	СтрокиДокумента.СпособОтраженияВБухучете,
	               |	ВЫБОР КОГДА СтрокиДокумента.Подразделение.Владелец <> &Организация ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	               |	МИНИМУМ(ПересекающиесяСтроки.НомерСтроки) КАК КонфликтнаяСтрока,
	               |	НадбавкиПоШтатномуРасписаниюОрганизаций.Регистратор.Представление КАК КонфликтныйДокумент 
	               |ИЗ
	               |	Документ.ИзменениеШтатногоРасписанияОрганизаций.Надбавки КАК СтрокиДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеШтатногоРасписанияОрганизаций.Надбавки КАК ПересекающиесяСтроки
	               |		ПО СтрокиДокумента.Ссылка = ПересекающиесяСтроки.Ссылка И СтрокиДокумента.Подразделение = ПересекающиесяСтроки.Подразделение И СтрокиДокумента.Должность = ПересекающиесяСтроки.Должность И СтрокиДокумента.НомерСтроки < ПересекающиесяСтроки.НомерСтроки И СтрокиДокумента.ВидНадбавки = ПересекающиесяСтроки.ВидНадбавки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций КАК НадбавкиПоШтатномуРасписаниюОрганизаций
	               |		ПО СтрокиДокумента.Подразделение = НадбавкиПоШтатномуРасписаниюОрганизаций.ПодразделениеОрганизации И СтрокиДокумента.Должность = НадбавкиПоШтатномуРасписаниюОрганизаций.Должность И СтрокиДокумента.Должность = НадбавкиПоШтатномуРасписаниюОрганизаций.Должность И СтрокиДокумента.Ссылка.Дата = НадбавкиПоШтатномуРасписаниюОрганизаций.Период
	               |
	               |ГДЕ
	               |	СтрокиДокумента.Ссылка = &ДокументСсылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтрокиДокумента.НомерСтроки,
	               |	СтрокиДокумента.Подразделение,
	               |	СтрокиДокумента.Должность,
	               |	СтрокиДокумента.ВидНадбавки,
	               |	СтрокиДокумента.Показатель1,
				   |	СтрокиДокумента.Показатель2,
				   |	СтрокиДокумента.Показатель3,
				   |	СтрокиДокумента.Показатель4,
				   |	СтрокиДокумента.Показатель5,
				   |	СтрокиДокумента.Показатель6,
				   |	СтрокиДокумента.Валюта1,
				   |	СтрокиДокумента.Валюта2,
				   |	СтрокиДокумента.Валюта3,
				   |	СтрокиДокумента.Валюта4,
				   |	СтрокиДокумента.Валюта5,
				   |	СтрокиДокумента.Валюта6,
	               |	СтрокиДокумента.СпособОтраженияВБухучете,
				   |	НадбавкиПоШтатномуРасписаниюОрганизаций.Регистратор";
				   
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоВыданныеАвансы()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	// Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не указана организация!';uk='Не зазначена організація!'"), Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Штатные единицы" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиШтатнойЕдиницы(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									НСтр("ru='"" табл. части ""Штатные единицы"": ';uk='"" табл. частини ""Штатні одиниці"": '");
									
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Подразделение) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбрано подразделение!';uk='не обраний підрозділ!'"), Отказ);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='указано подразделение другой организации!';uk='зазначений інший підрозділ організації!'"), Отказ);
	КонецЕсли;

	// Должность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбрана должность!';uk='не обрана посада!'"), Отказ);
	КонецЕсли;

	// КоличествоСтавок требуем только для новых строк
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КоличествоСтавок) и НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БылоСтавок) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указано количество ставок по создаваемой штатной единице!';uk='не зазначена кількість ставок по створюваній штатній одиниці!'"), Отказ);
	КонецЕсли;

	// если строка шт.расписания вычеркивается - проверяем не все
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КоличествоСтавок) или НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БылоСтавок) Тогда
		
		// ВидТарифнойСтавки
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидТарифнойСтавки) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан вид тарифной ставки!';uk='не зазначений вид тарифної ставки!'"), Отказ);
		КонецЕсли;
		
		// ГрафикРаботы
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан график работы!';uk='не зазначений графік роботи!'"), Отказ);
		КонецЕсли;
		
		// Валюта
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВалютаТарифнойСтавки) Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана валюта!';uk='не вказана валюта!'"), Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// повторяющиеся строки
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтнаяСтрока) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в строке № ';uk='у рядку № '") + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрока + НСтр("ru=' повторно описывается та же штатная единица!';uk=' повторно описується та ж штатна одиниця!'"), Отказ);
	КонецЕсли;
	
	// конфликтующий документ
	Если ВыборкаПоСтрокамДокумента.НайденоСуществующееДвижение <> Ложь Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='документом ';uk='документом '") + ВыборкаПоСтрокамДокумента.НайденоСуществующееДвижение + НСтр("ru=' штатная единица уже описана!';uk=' штатна одиниця вже описана!'"), Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиШтатнойЕдиницы()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Надбавки" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиНадбавок(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									НСтр("ru='"" табл. части ""Надбавки"": ';uk='"" табл. частини ""Надбавки"": '");
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Подразделение) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбрано подразделение!';uk='не обраний підрозділ!'"), Отказ);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='указано подразделение, принадлежащее другой организации!';uk='вказано підрозділ, що належить іншій організації!'"), Отказ);
	КонецЕсли;

	// Должность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбрана должность!';uk='не обрана посада!'"), Отказ);
	КонецЕсли;

	// ВидНадбавки
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидНадбавки) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбрана надбавка!';uk='не обрана надбавка!'"), Отказ);
	КонецЕсли;

	// Валюта
//	Если ВыборкаПоСтрокамДокумента.ВидНадбавкиСпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.Процентом и НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Валюта) Тогда
//		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указана валюта!", Отказ);
//	КонецЕсли;

	// повторяющиеся строки
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтнаяСтрока) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в строке № ';uk='у рядку № '") + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрока + НСтр("ru=' повторно описывается та же надбавка!';uk=' повторно описується та ж надбавка!'"), Отказ);
	КонецЕсли;
	
	// конфликтующий документ
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтныйДокумент) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='документом ';uk='документом '") + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + НСтр("ru='надбавка по штатной единице уже описана!';uk='надбавка по штатній одиниці вже описана!'"), Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНадбавок()

// Создает и заполняет структуру, содержащую имена регистров сведений 
//  по которым надо проводить документ
//
// Параметры: 
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров сведений 
//                                           по которым надо проводить документ
//
// Возвращаемое значение:
//  Нет.
//
Процедура ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамСведений)

	СтруктураПроведенияПоРегистрамСведений = Новый Структура();
	
	СтруктураПроведенияПоРегистрамСведений.Вставить("ШтатноеРасписаниеОрганизаций");
	СтруктураПроведенияПоРегистрамСведений.Вставить("НадбавкиПоШтатномуРасписаниюОрганизаций");

КонецПроцедуры // ЗаполнитьСтруктуруПроведенияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВШтатноеРасписание(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, 
		  СтруктураПроведенияПоРегистрамСведений, СтруктураПараметров = "")

	// Если документ нужно проводить по регистру, то для него есть ключ в структуре
	ИмяРегистра = "ШтатноеРасписаниеОрганизаций";
	Если СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра) Тогда

		Движение = Движения[ИмяРегистра].Добавить();

		// Свойства
		Движение.Период						= ВыборкаПоШапкеДокумента  .Дата;

		// Измерения
		Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.Подразделение;
		Движение.Должность					= ВыборкаПоСтрокамДокумента.Должность;

		// Ресурсы
		Движение.КоличествоСтавок			= ВыборкаПоСтрокамДокумента.КоличествоСтавок;
		Движение.МинимальнаяТарифнаяСтавка	= ВыборкаПоСтрокамДокумента.МинимальнаяТарифнаяСтавка;
		Движение.МаксимальнаяТарифнаяСтавка = ВыборкаПоСтрокамДокумента.МаксимальнаяТарифнаяСтавка;
		Движение.ВидТарифнойСтавки			= ВыборкаПоСтрокамДокумента.ВидТарифнойСтавки;
		Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
		Движение.ВалютаТарифнойСтавки		= ВыборкаПоСтрокамДокумента.ВалютаТарифнойСтавки;
		Движение.СпособОтраженияВБухучете	= ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
		Движение.ОсновноеНачисление			= ВыборкаПоСтрокамДокумента.ОсновноеНачисление;
		// Реквизиты
		Движение.СозданоНовыхРабочихМест	= ВыборкаПоСтрокамДокумента.СозданоНовыхРабочихМест;
		
	КонецЕсли; 
					
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуНадбавок(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, 
		  СтруктураПроведенияПоРегистрамСведений, СтруктураПараметров = "")
		  
		  // Если документ нужно проводить по регистру, то для него есть ключ в структуре
		  ИмяРегистра = "НадбавкиПоШтатномуРасписаниюОрганизаций";
		  Если СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра) Тогда
			  
			  Движение = Движения[ИмяРегистра].Добавить();
			  
			  // Свойства
			  Движение.Период						= ВыборкаПоШапкеДокумента  .Дата;
			  
			  // Измерения
			  Движение.ПодразделениеОрганизации		= ВыборкаПоСтрокамДокумента.Подразделение;
			  Движение.Должность					= ВыборкаПоСтрокамДокумента.Должность;
			  Движение.ВидНадбавки					= ВыборкаПоСтрокамДокумента.ВидНадбавки;
			  
			  // Ресурсы
			  Движение.Показатель1					= ВыборкаПоСтрокамДокумента.Показатель1;
			  Движение.Показатель2					= ВыборкаПоСтрокамДокумента.Показатель2;
			  Движение.Показатель3					= ВыборкаПоСтрокамДокумента.Показатель3;
			  Движение.Показатель4					= ВыборкаПоСтрокамДокумента.Показатель4;
			  Движение.Показатель5					= ВыборкаПоСтрокамДокумента.Показатель5;
			  Движение.Показатель6					= ВыборкаПоСтрокамДокумента.Показатель6;
			  Движение.Валюта1						= ВыборкаПоСтрокамДокумента.Валюта1;
			  Движение.Валюта2						= ВыборкаПоСтрокамДокумента.Валюта2;
			  Движение.Валюта3						= ВыборкаПоСтрокамДокумента.Валюта3;
			  Движение.Валюта4						= ВыборкаПоСтрокамДокумента.Валюта4;
			  Движение.Валюта5						= ВыборкаПоСтрокамДокумента.Валюта5;
			  Движение.Валюта6						= ВыборкаПоСтрокамДокумента.Валюта6;
			  Движение.СпособОтраженияВБухучете		= ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
			  
		  КонецЕсли;
					
	  КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений
	  
	  
//////////////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выводит строки показателей в документах ввода плановых начислений и удержаний
//
Процедура ПриВыводеСтрокиПлановыхНачислений(Элемент, ОформлениеСтроки, ДанныеСтроки, СведенияОВидахРасчета) Экспорт
		
	
	СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.ВидНадбавки);
	
	ТолькоПросмотрЯчеек = Ложь;
	
	ЕстьПоказатели = Ложь;
	Для СчПоказателей = 1 По 6 Цикл
		УстановитьТолькоПросмотр = ТолькоПросмотрЯчеек;
		Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда			
			
			Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
				ЕстьПоказатели = Истина;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Истина;
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].УстановитьТекст(Формат(ДанныеСтроки["Показатель" + СчПоказателей],"ЧДЦ=" + СведенияОВидеРасчета["Показатель" + СчПоказателей + "Точность"]));
			Иначе
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			КонецЕсли;
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].ТолькоПросмотр = (НЕ СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"]) ИЛИ (УстановитьТолькоПросмотр);
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = УстановитьТолькоПросмотр;
		Иначе
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если не ЕстьПоказатели Тогда
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.УстановитьТекст(НСтр("ru='<ввод при расчете>';uk='<введення при розрахунку>'"));
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
		ОформлениеСтроки.Ячейки["Показатель1"].ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	
КонецПроцедуры //ПриВыводеСтрокиПлановыхНачислений


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//структура, содержащая имена регистров сведений по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамСведений;

	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
    РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	// Получим реквизиты шапки из запроса
    ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда

			// Создадим и заполним структуры, содержащие имена регистров, по которым в зависимости от типа учета
			// проводится документ. В дальнейшем будем считать, что если для регистра не создан ключ в структуре,
			// то проводить по нему не надо.
			ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамСведений);

			РезультатЗапросаПоШтатныеЕдиницы = СформироватьЗапросПоШтатныеЕдиницы(Режим);
		    РезультатЗапросаПоНадбавки = СформироватьЗапросПоНадбавки(Режим);

			// В циклах по строкам табличных частей будем добавлять информацию в движения регистров
	        ВыборкаПоШтатныеЕдиницы = РезультатЗапросаПоШтатныеЕдиницы.Выбрать();
	        Пока ВыборкаПоШтатныеЕдиницы.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиШтатнойЕдиницы(ВыборкаПоШапкеДокумента, ВыборкаПоШтатныеЕдиницы, Отказ);

				// Движения стоит записывать, если в проведении еще не отказано (отказ =ложь)
				Если Не Отказ Тогда
					ДобавитьСтрокуВШтатноеРасписание(ВыборкаПоШапкеДокумента, ВыборкаПоШтатныеЕдиницы, СтруктураПроведенияПоРегистрамСведений);
				КонецЕсли;

			КонецЦикла;
			
	        ВыборкаПоНадбавки = РезультатЗапросаПоНадбавки.Выбрать();
	        Пока ВыборкаПоНадбавки.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНадбавок(ВыборкаПоШапкеДокумента, ВыборкаПоНадбавки, Отказ);

				// Движения стоит записывать, если в проведении еще не отказано (отказ =ложь)
				Если Не Отказ Тогда
					ДобавитьСтрокуНадбавок(ВыборкаПоШапкеДокумента, ВыборкаПоНадбавки, СтруктураПроведенияПоРегистрамСведений);
				КонецЕсли;

			КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание = Неопределено)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;

	#Если Не Клиент И Не ВнешнееСоединение Тогда
		
		глТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
	#КонецЕсли
	
	// Вызвать общую процедуру для заполнения основных реквизитов
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));

	// Дозаполнить особенные для формы реквизиты
	// Заполнить реквизиты по метаданным на полное совпадение имени и типа
	Для каждого РеквизитШапки Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		Попытка
			Если Строка(Основание.Метаданные().Реквизиты[РеквизитШапки.Имя].Тип) = Строка(РеквизитШапки.Тип) Тогда
				ЭтотОбъект[РеквизитШапки.Имя] = Основание[РеквизитШапки.Имя];
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;

	// Заполнить отдельно для каждого вида основания в зависимости от типа/вида
	ЭтотОбъект.Комментарий = НСтр("ru='Введен на основании документа ';uk='Введений на підставі документа '") + Основание.Метаданные().Представление() + " №" +
							 Основание.Номер + ".";

						 
КонецПроцедуры // ОбработкаЗаполнения()  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
    	Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры 

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
